tests/file-service/load.yml
config:
  environments:
    dev:
      target: 'https://file-service.adsp-dev.gov.ab.ca'
    uat:
      target: 'https://file-service.adsp-uat.alberta.ca'
  processor: './functions.js'
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
  payload:
    - path: '../artillery.{{ $environment }}.csv'
      skipHeader: true
      fields:
        - 'keycloak_url'
        - 'realm_id'
        - 'tenant_name'
        - 'client_id'
    - path: './files.{{ $environment }}.csv'
      skipHeader: true
      fields:
        - 'file_id'
  variables:
    typeId:
      - 'artillery-load-test'
    filename:
      - 'logo.png'
  phases:
    - name: warm up
      duration: 60
      arrivalCount: 50
    - name: load
      duration: 1
      arrivalCount: 1
before:
  flow:
    - log: 'Getting the access token (tenant: {{ realm_id }}) for client {{ client_id }}'
    - post:
        url: '{{ keycloak_url }}/auth/realms/{{ realm_id }}/protocol/openid-connect/token'
        headers:
          Content-Type: 'application/x-www-form-urlencoded'
          Accept: 'application/json'
        form:
          {
            grant_type: 'client_credentials',
            client_id: '{{ client_id }}',
            client_secret: '{{ $processEnvironment.ARTILLERY_CLIENT_SECRET }}',
          }

        capture:
          - json: '$.access_token'
            as: token
scenarios:
  - name: read file metadata
    weight: 1
    flow:
      - get:
          url: '/file/v1/files/{{ file_id }}'
          headers:
            authorization: 'Bearer {{ token }}'
  - name: read and download file
    weight: 1
    flow:
      - get:
          url: '/file/v1/files/{{ file_id }}'
          headers:
            authorization: 'Bearer {{ token }}'
      - get:
          url: '/file/v1/files/{{ file_id }}/download'
          headers:
            authorization: 'Bearer {{ token }}'
  - name: upload a file
    weight: 1
    flow:
      - post:
          url: '/file/v1/files'
          headers:
            authorization: 'Bearer {{ token }}'
          beforeRequest: 'setFormFile'